Tekla Open API Reference for Tekla Structures 2025
View.ViewMarkTagsAttributes Constructor (View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes, View.ViewMarkTagAttributes)
 Creates a new mark tags attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewMarkTagsAttributes(
	View.ViewMarkTagAttributes tagA1,
	View.ViewMarkTagAttributes tagA2,
	View.ViewMarkTagAttributes tagA3,
	View.ViewMarkTagAttributes tagA4,
	View.ViewMarkTagAttributes tagA5
)
Public Sub New (
	tagA1 As View.ViewMarkTagAttributes,
	tagA2 As View.ViewMarkTagAttributes,
	tagA3 As View.ViewMarkTagAttributes,
	tagA4 As View.ViewMarkTagAttributes,
	tagA5 As View.ViewMarkTagAttributes
)
Parameters
tagA1
Type: Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The tag at place A1.
tagA2
Type: Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The tag at place A2.
tagA3
Type: Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The tag at place A3.
tagA4
Type: Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The tag at place A4.
tagA5
Type: Tekla.Structures.Drawing.View.ViewMarkTagAttributes
The tag at place A5.
See Also
Reference
View.ViewMarkTagsAttributes Class
View.ViewMarkTagsAttributes Overload
Tekla.Structures.Drawing Namespace